h27_rails_visits_homework/B_24_Slav_Kirilov/app/controllers/visitors_controller.rb

SELECT "visitors"."id" FROM "visitors"
---
  def index
    @id = Visitor.all

SELECT  "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", nil]]
---
  def show
  	@id = Visitor.find(params[:user])

SELECT  1 AS one FROM "visitors" WHERE "visitors"."visitor_id" IS NULL LIMIT 1
SELECT "visitors"."id" FROM "visitors"
INSERT INTO "visitors" ("id", "visits", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 50], ["visits", 1], ["created_at", "2017-01-23 11:04:28.107571"], ["updated_at", "2017-01-23 11:04:28.107571"]]
SELECT  "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "visitors" SET "visits" = $1, "updated_at" = $2 WHERE "visitors"."id" = $3  [["visits", 1], ["updated_at", "2017-01-23 07:51:34.145976"], ["id", 1]]
---
  def create
  	if !Visitor.exists?(params[:user]) and !Visitor.exists?(params[:id])
  		@id = Visitor.new
  		@id.user = params[:user]
  		@id.id = params[:user]
  		@id.visit
  		@id.save
  	else
  		@id = Visitor.find(params[:user])
  		@id.visit
  		@id.save