h27_rails_visits_homework/A_07_Dimitar_Nikolov/app/controllers/visits_controller.rb

  def increment
    @visit.increment_count.save
---
INSERT INTO "visits" ("user", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user", "400"], ["created_at", 2017-01-26 20:44:56 UTC], ["updated_at", 2017-01-26 20:44:56 UTC]]
UPDATE "visits" SET "count" = $1, "updated_at" = $2 WHERE "visits"."id" = $3  [["count", 1], ["updated_at", 2017-01-26 20:22:17 UTC], ["id", 1]]

  def find_visit
    @visit = Visit.find_or_create_by(:user => params[:user])
---
INSERT INTO "visits" ("user", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user", "mitko"], ["created_at", 2017-01-26 19:08:21 UTC], ["updated_at", 2017-01-26 19:08:21 UTC]]
SELECT  "visits".* FROM "visits" WHERE "visits"."user" = $1 LIMIT $2  [["user", "mitko"], ["LIMIT", 1]]