h27_rails_visits_homework/A_20_Marina_Tihova/app/controllers/visits_controller.rb

SELECT  "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
  def get_id
    user_id = params[:user]

    if Visit.exists?(user_id)
      @curr_visitor = Visit.find(user_id)