hm_term2_order_api/B_11_Daniel_Tuechki/app/controllers/articles_controller.rb

	def create
		@article = Article.new
		@article.name = params[:name]
		@article.save
---
INSERT INTO "articles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "first here"], ["created_at", 2017-02-20 09:58:04 UTC], ["updated_at", 2017-02-20 09:58:04 UTC]]

	def show
		if params[:order] == "normdist" then
			calculate_comments_score
			calculate_votes_score
			calculate_general_scores
			render json: Article.order(:general_score),
			:except => [:general_score, :created_at, :updated_at]
		else
			render json: Article.order(:name),
			:except => [:comments_score, :votes_score, :general_score]
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."general_score" ASC
SELECT "articles".* FROM "articles" ORDER BY "articles"."name" ASC

	def show_by_id

		if params[:order] == "normdist" then
			calculate_comments_score
			calculate_votes_score
			calculate_general_scores
			@article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]