hm_term2_order_api/B_11_Daniel_Tuechki/app/controllers/comments_controller.rb

	def create
		@comment = Comment.new
		@comment.article_id = params[:article_id]
		@comment.content = params[:content]
		@comment.save
---
INSERT INTO "comments" ("article_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 2], ["content", "this is a comment as you can see"], ["created_at", 2017-02-20 10:01:45 UTC], ["updated_at", 2017-02-20 10:01:45 UTC]]

	def show
		render json: Comment.order(:content),
		:except => [:created_at, :updated_at]
---
SELECT "comments".* FROM "comments" ORDER BY "comments"."content" ASC