hm_term2_order_api/B_11_Daniel_Tuechki/app/controllers/votes_controller.rb

INSERT INTO "votes" ("article_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 4], ["value", 5], ["created_at", 2017-02-20 10:04:40 UTC], ["updated_at", 2017-02-20 10:04:40 UTC]]
---
	def create
		@vote = Vote.new
		@vote.article_id = params[:article_id]
		@vote.value = params[:value]
		@vote.save

SELECT "votes".* FROM "votes" ORDER BY "votes"."created_at" ASC
---
	def show
		render json: Vote.order(:created_at),
		:except => [:created_at, :updated_at]