hm_term2_order_api/A_02_Blagovest_Mihailov/app/controllers/articles_controller.rb

	def index
		if params[:order] == "normdist"
			Article.all.each do |a|
				vote_score = 0
				comment_score = 0
				Votw.all.each do |v|
					if v[:article_id].to_i == a[:id].to_i
						vote_score += v[:value]
					end
				end


				Comment.all.each do |c|
					if c[:article_id].to_i == a[:id].to_i
						comment_score += 1
					end
				end
				puts vote_score + comment_score
				a[:score] = vote_score + comment_score
				a.save
			end
			arr = Article.order(:score)
			arr = arr.as_json.each do |k|
					k.delete("score")

			end
			render :json => arr

		else
			arr = Article.order(:name)
---
SELECT "articles".* FROM "articles"
SELECT "votws".* FROM "votws"
SELECT "comments".* FROM "comments"
SELECT "articles".* FROM "articles" ORDER BY "articles"."score" ASC
SELECT "articles".* FROM "articles" ORDER BY "articles"."name" ASC

	def create
		j = JSON.parse(request.raw_post)
		@article = Article.new
		@article[:name] = j['name']
		@article.save
---
INSERT INTO "articles" ("article_name", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_name", "abv"], ["article_id", 12], ["created_at", 2017-02-19 10:23:44 UTC], ["updated_at", 2017-02-19 10:23:44 UTC]]

	def get_article
		if params[:order] != "normdist"
			@article = Article.find_or_initialize_by(id: params[:id])


			if @article.persisted?
				render :json =>
				{
					"name" => @article[:name],
					"id" => @article[:id],
					"created_at" => @article[:created_at],
					"update_at" => @article[:updated_at]
				}

			else
				render :json => {}
			end
		else
			vote_score = 0
			comment_score = 0

			Votw.all.each do |v|
				if v[:article_id].to_i == params[:id].to_i
					vote_score += v[:value]
				end
			end


			Comment.all.each do |c|
---
SELECT  "articles".* FROM "articles" WHERE "articles"."article_id" = $1 LIMIT $2  [["article_id", nil], ["LIMIT", 1]]
SELECT "votws".* FROM "votws"
SELECT "comments".* FROM "comments"