hm_term2_order_api/A_02_Blagovest_Mihailov/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" ORDER BY "comments"."content" ASC
---
	def index
		arr = Comment.order(:content)

INSERT INTO "comments" ("comment_content", "comment_id", "identifier", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_content", "some text"], ["comment_id", 1], ["identifier", 3], ["created_at", 2017-02-19 13:37:12 UTC], ["updated_at", 2017-02-19 13:37:12 UTC]]
---
	def create
		j = JSON.parse(request.raw_post)
		@comment = Comment.new
		@comment[:article_id] = j['article_id']
		@comment[:content] = j['content']
		@comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."comment_id" = $1 LIMIT $2  [["comment_id", 2], ["LIMIT", 1]]
---
	def get_comment

	@comment = Comment.find_or_initialize_by(id: params[:id])

SELECT "comments".* FROM "comments" WHERE (article_id = '1') ORDER BY "comments"."content" ASC
---
	def sort

		arr1 = []
		arr = Comment.order(:content)