hm_term2_order_api/A_02_Blagovest_Mihailov/app/controllers/votes_controller.rb

SELECT "votws".* FROM "votws" ORDER BY "votws"."created_at" ASC
---
	def index
		arr = Votw.order(:created_at)

INSERT INTO "votws" ("article_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 2], ["value", 100.0], ["created_at", 2017-02-19 17:48:33 UTC], ["updated_at", 2017-02-19 17:48:33 UTC]]
---
	def create
		j = JSON.parse(request.raw_post)
		@vote = Votw.new
		@vote[:article_id] = j['article_id']
		@vote[:value] = j['value']
		@vote.save