hm_term2_order_api/A_27_Stoyan_Ivanov/app/controllers/article_controller.rb

	def index
		@articles = Article.all
		if !params.key?("order")
			@articles = Article.order(:name).as_json.each do |entry|
				entry.delete("comments_score")
				entry.delete("votes_score")
				entry.delete("normdist")
			end
		elsif
			normdist
			@articles = Article.order(:normdist).as_json.each do |entry|
---
SELECT "articles".* FROM "articles"
SELECT "articles"."name" FROM "articles" ORDER BY "articles"."name" ASC
SELECT "articles".* FROM "articles" ORDER BY "articles"."normdist" ASC

	def create
		@article = Article.new
		@article.name = params[:name]
		@article.save
---
INSERT INTO "articles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Pencho"], ["created_at", 2017-02-18 13:42:29 UTC], ["updated_at", 2017-02-18 13:42:29 UTC]]