hm_term2_order_api/A_27_Stoyan_Ivanov/app/controllers/comment_controller.rb

SELECT "comments".* FROM "comments" ORDER BY "comments"."content" ASC
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 ORDER BY "comments"."content" ASC  [["article_id", 4]]
---
	def index
		if !params[:id]
			@comments = Comment.all.order(:content).as_json.each do |entry|
				entry.delete("created_at")
				entry.delete("updated_at")
			end

			render :json => @comments
			return
		end

		@comments = Comment.where(article_id: params[:id]).order(:content).as_json.each do |entry|

INSERT INTO "comments" ("article_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 3], ["content", "PenchoComentara"], ["created_at", 2017-02-18 17:39:32 UTC], ["updated_at", 2017-02-18 17:39:32 UTC]]
---
	def create
		@comment = Comment.new
		@comment.article_id = params[:article_id]
		@comment.content = params[:content]
		@comment.save