hm_term2_order_api/B_07_Victor_Gyoshev/app/controllers/articles_controller.rb

    def show
        if params[:order] != "normdist"
            if !params[:id].blank?
                if Article.where(id: params[:id]).empty?
                    render text: "Couldn't find article with such ID."
                else
                    @article = Article.find(params[:id])
                    render json: @article, except: [:comments_score, :votes_score]
                end
            else
                render json: Article.order(:name), except: [:comments_score, :votes_score]
            end
        else

            @mincom = 10000000
            @maxcom = 0
            @currcom = 0
            @minvot = 10000000
            @maxvot = 0
            @currvot = 0
            Article.all.each do |artic|
                @currcom = Comment.where(article_id: artic.id).count
                @currvot = Vote.where(article_id: artic.id).count
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."id" = $1  [["id", 2]]
SELECT "articles".* FROM "articles" ORDER BY "articles"."name" ASC
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = $1  [["article_id", 3]]

                if Article.where(id: params[:id]).empty?
                    render text: "Couldn't find article with such ID."
                else
                    render json: Article.where(id: params[:id]), only: [:id, :name, :comments_score, :votes_score]
                end
            else
                render json: Article.order(:comments_score, :votes_score), only: [:id, :name, :comments_score, :votes_score]
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 ORDER BY "articles"."name" ASC LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" ORDER BY "articles"."comments_score" ASC, "articles"."votes_score" ASC

    def create
        if !params[:name].blank?
            if Article.where(name: params[:name]).empty?
                Article.create(name: params[:name])
---
SELECT "articles".* FROM "articles" WHERE "articles"."name" = $1  [["name", "Hello"]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."name" = $1  [["name", "Hello"]]
INSERT INTO "articles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Hello"], ["created_at", 2017-02-20 22:20:15 UTC], ["updated_at", 2017-02-20 22:20:15 UTC]]