hm_term2_order_api/B_07_Victor_Gyoshev/app/controllers/comments_controller.rb

    def show
        if !params[:id].blank?
            if Comment.where(id: params[:id]).empty?
                render text: "Couldn't find comment with such ID."
            else
                @comment = Comment.find(params[:id])
                render json: @comment, only: [:id, :article_id, :content]
            end
        else
            render json: Comment.order(:content), only: [:id, :article_id, :content]
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
SELECT "comments".* FROM "comments" ORDER BY "comments"."content" ASC

    def create
        if !params[:article_id].blank?
            if Article.where(id: params[:article_id]).empty?
                render text: "Couldn't find article with such id."
            else
                Comment.create(article_id: params[:article_id], content: params[:content])
                @comment = Comment.last
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."id" = $1  [["id", 2]]
INSERT INTO "comments" ("article_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 2], ["content", "hellobrotherhowareyou"], ["created_at", 2017-02-20 22:36:38 UTC], ["updated_at", 2017-02-20 22:36:38 UTC]]
SELECT  "comments".* FROM "comments" ORDER BY "comments"."id" DESC LIMIT $1  [["LIMIT", 1]]

    def commentshow
        if !params[:id].blank?
            render json: Comment.order(:content).where(article_id: params[:id]), only: [:id, :article_id, :content]
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 ORDER BY "comments"."content" ASC  [["article_id", 2]]