hm_term2_order_api/B_07_Victor_Gyoshev/app/controllers/votes_controller.rb

SELECT "votes".* FROM "votes" ORDER BY "votes"."created_at" ASC
---
    def show
        render json: Vote.order(:created_at), only: [:article_id, :value, :id]

SELECT COUNT(*) FROM "articles" WHERE "articles"."id" = $1  [["id", 2]]
INSERT INTO "votes" ("article_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 2], ["value", 123], ["created_at", 2017-02-20 22:53:43 UTC], ["updated_at", 2017-02-20 22:53:43 UTC]]
SELECT  "votes".* FROM "votes" ORDER BY "votes"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def create
        if !(params[:article_id].blank? || params[:value].blank?)
            if Article.where(id: params[:article_id]).empty?
                render text: "Article doesn't exist"
            else
                Vote.create(article_id: params[:article_id], value: params[:value])
                @vote = Vote.last