h27_rails_visits_homework/B_21_Nikola_Tzotchev/app/controllers/visits_controller.rb

SELECT "visits".* FROM "visits"
---
  def index
    @vis = Visit.all

SELECT  "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    if !Visit.exists?(params[:user])
      @vis = create
    end
      @vis = Visit.find(params[:user])

SELECT "visits".* FROM "visits" WHERE "visits"."user" = $1  [["user", 50]]
SELECT  "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "visits" ("id", "user", "visited", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 50], ["user", 50], ["visited", 1], ["created_at", 2017-01-26 20:47:18 UTC], ["updated_at", 2017-01-26 20:47:18 UTC]]
UPDATE "visits" SET "visited" = $1, "updated_at" = $2 WHERE "visits"."id" = $3  [["visited", 2], ["updated_at", 2017-01-26 14:55:59 UTC], ["id", 3]]
---
  def create
    if Visit.exists?(params[:user])
      @vis = Visit.find(params[:user])
      @vis.visited += 1
    else
      @vis = Visit.new
      @vis.id = params[:user]
      @vis.user = params[:user]
      @vis.visited = 1
    end
    @vis.save