hm_term2_order_api/B_24_Slav_Kirilov/app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE (1)
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("article_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 28], ["content", "Slavkata Rules"], ["created_at", "2017-02-17 11:17:16.104264"], ["updated_at", "2017-02-17 11:17:16.104264"]]
---
	def create
		if Article.exists?(params[:article_id])
			@article = Article.find(params[:article_id])
			@comment = Comment.new
			@comment.article_id = params[:article_id]
			@comment.content = params[:content]
			@comment.save

SELECT "comments".* FROM "comments"  ORDER BY "comments"."content" ASC
SELECT "comments".* FROM "comments"
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 989]]
---
	def index
		if !params[:article_id] then
			@comment = Comment.order('content ASC')
			@final = @comment.as_json.each do |f|
				f.delete("created_at")
				f.delete("updated_at")
			end
			render :json => @final
		else
			@comment = Comment.where(article_id: params[:article_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", nil]]
DELETE FROM "comments" WHERE "comments"."id" = $1 AND "comments"."id" = $2  [["id", 1], ["id", 0]]
---
	def show
		@comment = Comment.find(params[:id])
		@final = @comment.as_json
		@final.delete("created_at")