hm_term2_order_api/B_24_Slav_Kirilov/app/controllers/votes_controller.rb

	def create
		if Article.exists?(params[:article_id])
			@article = Article.find(params[:article_id])
			@vote = Vote.new
			@vote.article_id = params[:article_id]
			@vote.value = params[:value]
			@vote.save
---
SELECT "articles".* FROM "articles"
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."article_id" = $1  [["article_id", 1]]
INSERT INTO "votes" ("article_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", "4"], ["value", "Dislike"], ["created_at", "2017-02-17 19:28:24.892563"], ["updated_at", "2017-02-17 19:28:24.892563"]]

	def index
		@vote = Vote.order(:created_at)
---
SELECT "votes".* FROM "votes"  ORDER BY "votes"."created_at" ASC