h27_rails_visits_homework/A_14_Ivo_Todorov/app/controllers/visits_controller.rb

	def show
		if(User.exists?(params[:user]))
			@user = User.find(params[:user])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def add
		@user
		if !User.exists?(params[:user])
			@user = User.new
			@user.number = params[:user]
			@user.id = params[:user]
			@user.visits = 0
		else
			@user = User.find(params[:user])
		end
		@user.add_visit
		@user.save
---
INSERT INTO "users" ("id", "number", "visits", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 1], ["number", 1], ["visits", 1], ["created_at", 2017-01-27 20:56:39 UTC], ["updated_at", 2017-01-27 20:56:39 UTC]]