hm_term2_order_api/A_01_Alexander_Stoyanov/app/controllers/articles_controller.rb

  def index
    @articles = Article.order(:title).all
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."title" ASC

  def create
  @article = Article.new(article_params)

  @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "bengis"], ["text", "bengis is fun\r\n"], ["created_at", 2017-02-20 19:03:57 UTC], ["updated_at", 2017-02-20 19:03:57 UTC]]