h27_rails_visits_homework/A_10_Iva_Zahova/app/controllers/visits_controller.rb

SELECT  "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "visitors" SET "counter" = $1, "updated_at" = $2 WHERE "visitors"."id" = $3  [["counter", 2], ["updated_at", "2017-01-28 21:42:57.868068"], ["id", 1]]
INSERT INTO "visitors" ("nut", "counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nut", 5], ["counter", 1], ["created_at", "2017-01-28 21:37:57.840956"], ["updated_at", "2017-01-28 21:37:57.840956"]]
---
	def count
		if Visitor.exists?(params[:user])
			@visitor = Visitor.find(params[:user])
			@visitor.counter += 1
			@visitor.save
		else
			@visitor = Visitor.new
			@visitor.nut = params[:user]
			@visitor.counter = 1
			@visitor.id = params[:user]
			@visitor.save

SELECT  "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show_user
		if Visitor.exists?(params[:user])
			@visitor = Visitor.find(params[:user])