hm_term2_order_api/B_21_Nikola_Tzotchev/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY name
SELECT "articles".* FROM "articles" ORDER BY votes_score + comments_score
---
	def index
		if !params[:order]
	    @artc = Article.order('name')
			@name_array = @artc
			render :json => @name_array.to_json
		else
			@artc_all = Article.all

SELECT  "articles".* FROM "articles" WHERE "articles"."name" = $1 LIMIT $2  [["name", "767"], ["LIMIT", 1]]
SELECT  1 AS one FROM "articles" WHERE "articles"."name" = $1 LIMIT $2  [["name", "hihi"], ["LIMIT", 1]]
INSERT INTO "articles" ("id", "name", "created_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 130], ["name", "hihi"], ["created_time", "2017-02-18 19:25:11 +0200"], ["created_at", 2017-02-18 17:25:11 UTC], ["updated_at", 2017-02-18 17:25:11 UTC]]
UPDATE "articles" SET "updated_time" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["updated_time", "2017-02-18 20:02:12 +0200"], ["updated_at", 2017-02-18 18:02:12 UTC], ["id", 544]]
---
	def create
		if Article.exists?(:name => params[:name])
			@artc = Article.find_by(:name => params[:name])
		else
			@artc = Article.new
			@artc.name = params[:name]
		end
		@artc.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 516], ["LIMIT", 1]]
---
	def pasta
		if !params[:order]
			@artc = Article.find_by_id(params[:id])