hm_term2_order_api/B_21_Nikola_Tzotchev/app/controllers/comments_controller.rb

	def list
    @comm = Comment.order('content')
---
SELECT "comments".* FROM "comments" ORDER BY content

	def list_comm
		@comm = Comment.where(:article_id => params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 3]]

	def see
			@comm = Comment.find_by_id(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def create
		if Article.exists?(:id => params[:article_id])
			@comm = Comment.new
			@comm.article_id = params[:article_id]
			@comm.content = params[:content]
			@comm.save
---
INSERT INTO "comments" ("comment", "artc_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "pls visit h3h3"], ["artc_id", 598], ["created_at", 2017-02-19 10:41:05 UTC], ["updated_at", 2017-02-19 10:41:05 UTC]]