hm_term2_order_api/B_21_Nikola_Tzotchev/app/controllers/votes_controller.rb

	def votes
		if Article.exists?(:id => params[:article_id])
			@vote = Vote.new
			@vote.article_id = params[:article_id]
			@vote.value = params[:value]
			@vote.save
---
SELECT MIN("votes"."value") FROM "votes"
INSERT INTO "votes" ("value", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["value", 15], ["article_id", 3], ["created_at", 2017-02-20 07:48:32 UTC], ["updated_at", 2017-02-20 07:48:32 UTC]]

	def sort
		@vote = Vote.order('created_at')
---
SELECT "votes".* FROM "votes" ORDER BY created_at