hm_term2_order_api/B_03_Boris_Mutafov/app/controllers/articles_controller.rb

INSERT INTO "articles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "boris"], ["created_at", 2017-02-19 15:37:24 UTC], ["updated_at", 2017-02-19 15:37:24 UTC]]
---
   def create
      @article = Article.new
      @article.name = params[:name]
      @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
   def getid
      if params[:order] then
         normdist()
      else
         id = params[:id]
         @article = Article.find(id)

SELECT "articles".* FROM "articles" ORDER BY votes_score + comments_score
SELECT "articles".* FROM "articles" ORDER BY "articles"."name" ASC
---
   def getArticle
      if params[:order] then
         calculateNormDists()
         @article = Article.all.order('votes_score + comments_score')
         render :json => @article.as_json
      else
         @article = Article.all.order(:name)

INSERT INTO "comments" ("article_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", "1"], ["content", "cska"], ["created_at", 2017-02-19 16:53:28 UTC], ["updated_at", 2017-02-19 16:53:28 UTC]]
---
   def addComment
      @comment = Comment.new
      @comment.article_id = params[:article_id]
      @comment.content = params[:content]
      @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def getComId
      id = params[:id]
      @comment = Comment.find(id)

SELECT "comments".* FROM "comments" ORDER BY "comments"."content" ASC
---
   def getAllComs
      @comments = Comment.all.order(:content)

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 ORDER BY "comments"."content" ASC  [["article_id", 3]]
---
   def articleComms
      @comments = Comment.where(:article_id => params[:id]).order(:content)

INSERT INTO "votes" ("article_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 1], ["value", 555.0], ["created_at", 2017-02-19 17:34:25 UTC], ["updated_at", 2017-02-19 17:34:25 UTC]]
---
   def votes
      @vote = Vote.new
      @vote.value = params[:value]
      @vote.article_id = params[:article_id]
      @vote.save

SELECT "votes".* FROM "votes" ORDER BY "votes"."created_at" ASC
---
   def getVotes
      @votes = Vote.all.order(:created_at)