hm_term2_order_api/A_20_Marina_Tihova/app/controllers/articles_controller.rb

INSERT INTO "articles" ("id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", 4], ["name", "Kill me pls"], ["created_at", 2017-02-19 17:36:05 UTC], ["updated_at", 2017-02-19 17:36:05 UTC]]
---
  def create
    article_json = JSON.parse(request.raw_post)

    @current = Article.create(article_json)

SELECT "articles".* FROM "articles"
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    if params[:order] == "normdist"
      score
      return
    end

    article_id = params[:id]
    if Article.exists?(article_id)
      @current = Article.find(article_id)

SELECT "articles".* FROM "articles"
---
  def index
    if params[:order] == "normdist"
      sort_by_score
      return
    end

    render :json => Article.all().sort_by{|a| a.name}.to_json

SELECT "comments".* FROM "comments" WHERE (article_id = '2')
---
  def all_article_comments
    output_json = Array.new
    Comment.all.where("article_id = ?", params[:id]).each do |c|