hm_term2_order_api/A_20_Marina_Tihova/app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 1], ["content", "the content of the comment"], ["created_at", 2017-02-19 18:09:34 UTC], ["updated_at", 2017-02-19 18:09:34 UTC]]
---
  def create
    comment_json = JSON.parse(request.raw_post)

    @current = Comment.create(comment_json)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    comment_id = params[:id]

    if Comment.exists?(comment_id)
      @current = Comment.find(comment_id)

SELECT "comments".* FROM "comments"
---
  def index
    #not sure if sorting works well - first puts capital letters; created_at da se slaga li??
    # render :json => Comment.all().sort_by{|c| c.content}.to_json

    output_json = Array.new
    all =  Comment.all().sort_by{|c| c.content}