hm_term2_order_api/A_20_Marina_Tihova/app/controllers/votes_controller.rb

  def create
    vote_json = JSON.parse(request.raw_post)

    @current = Vote.create(vote_json)
---
INSERT INTO "votes" ("article_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 2], ["value", 100], ["created_at", 2017-02-19 18:49:18 UTC], ["updated_at", 2017-02-19 18:49:18 UTC]]

  def index
    output_json = Array.new
    all =  Vote.all().sort_by{|c| c.created_at}
---
SELECT "votes".* FROM "votes"