hm_term2_order_api/B_09_Georgi_Nizamski/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
UPDATE "articles" SET "updated_at" = $1, "comments_score" = $2 WHERE "articles"."id" = $3  [["updated_at", 2017-02-20 20:07:50 UTC], ["comments_score", 0.09441578409831511], ["id", 2]]
SELECT "articles".* FROM "articles" ORDER BY "articles"."normdist" ASC
SELECT "articles".* FROM "articles" ORDER BY "articles"."name" ASC
---
	def index
		list = Array.new
		if params.has_key? :order
			Article.all.each do |article|
				comment_score, votes_score, normaldist = calculate_normdist article.id

				article.update_attribute(:normdist, normaldist)
			 	article.update_attribute(:votes_score, votes_score)
			 	article.update_attribute(:comments_score, comment_score)
			end

			Article.order(:normdist).each do |article|
				list << article.normdist_format
			end
		else
			Article.order(:name).each do |article|

INSERT INTO "articles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "FirstArticle"], ["created_at", 2017-02-16 18:48:09 UTC], ["updated_at", 2017-02-16 18:48:09 UTC]]
---
	def create
		@article = Article.new
		@article.name = params[:name]
		@article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = $1, "comments_score" = $2 WHERE "articles"."id" = $3  [["updated_at", 2017-02-20 20:03:22 UTC], ["comments_score", 0.29082108898343734], ["id", 5]]
---
	def show
		if Article.exists?(params[:id])
		   if params.has_key? :order
		     article = Article.find(params[:id])

			 comment_score, votes_score, normaldist = calculate_normdist params[:id]

			 article.update_attribute(:normdist, normaldist)