hm_term2_order_api/B_09_Georgi_Nizamski/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 4]]
SELECT "comments".* FROM "comments" ORDER BY "comments"."content" ASC
---
	def index
		list = Array.new
		if params.has_key? :article_id
			Comment.where(article_id: params[:article_id]).each do |comment|
				list << comment.format
			end
		else
			Comment.order(:content).each do |comment|

INSERT INTO "comments" ("article_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 5], ["content", "This is first comment, on fifth article."], ["created_at", 2017-02-17 08:46:27 UTC], ["updated_at", 2017-02-17 08:46:27 UTC]]
---
	def create
		@comment = Comment.new
		@comment.article_id = params[:article_id]
		@comment.content = params[:content]
		@comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		if Comment.exists?(params[:id])
			@comment = Comment.find(params[:id])