hm_term2_order_api/B_09_Georgi_Nizamski/app/controllers/votes_controller.rb

	def index
		list = Array.new
		Vote.order(:created_at).each do |vote|
---
SELECT "votes".* FROM "votes" ORDER BY "votes"."created_at" ASC

	def create
		@vote = Vote.new
		@vote.article_id = params[:article_id]
		@vote.value = params[:value]
		@vote.save
---
INSERT INTO "votes" ("article_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 5], ["value", 1], ["created_at", 2017-02-17 17:54:11 UTC], ["updated_at", 2017-02-17 17:54:11 UTC]]