h28_rails_articles_sorting/A_11_Ivan_Milev/app/controllers/articles_controller.rb

INSERT INTO "articles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", 2017-02-18 17:57:57 UTC], ["updated_at", 2017-02-18 17:57:57 UTC]]
---
    def create
        article_name = params['name']
        article = Article.create :name => article_name

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        if params.key?('order')
            if params['order'] == 'normdist'
                return show_normdist(params)
            end
        end
        if Article.exists?(id: params['id'].to_i)
            article = Article.find_by id: params['id'].to_i

SELECT "articles".* FROM "articles" ORDER BY "articles"."name" ASC
---
    def show
        if params.key?('order')
            if params['order'] == 'normdist'
                return show_order_normdist(params)
            end
        end
        result = Array.new
        Article.order(:name).each do |article|

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 ORDER BY "comments"."content" ASC  [["article_id", 2]]
---
    def show_comments
        if Article.exists?(id: params['id'].to_i)
            article = Article.find_by id: params['id'].to_i
            comments = Comment.order(:content).where(article_id: article.id)