h28_rails_articles_sorting/A_11_Ivan_Milev/app/controllers/article_votes_controller.rb

    def create
        p params
        vote = ArticleVote.create(value: params['value'].to_i,
                                  article_id: params['article_id'].to_i)
---
INSERT INTO "article_votes" ("value", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["value", 10], ["article_id", 1], ["created_at", 2017-02-18 20:13:26 UTC], ["updated_at", 2017-02-18 20:13:26 UTC]]

    def show
        result = Array.new
        ArticleVote.order(:created_at).each do |vote|
---
SELECT "article_votes".* FROM "article_votes" ORDER BY "article_votes"."created_at" ASC