h28_rails_articles_sorting/A_11_Ivan_Milev/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "SomeContentForOne"], ["article_id", 1], ["created_at", 2017-02-18 20:08:24 UTC], ["updated_at", 2017-02-18 20:08:24 UTC]]
---
    def create
        content = params['content']
        article_id = params['article_id'].to_i
        comment = Comment.create(content: content, article_id: article_id)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        if Comment.exists?(id: params['id'].to_i)
            comment = Comment.find_by id: params['id'].to_i