h27_rails_visits_homework/B_09_Georgi_Nizamski/app/controllers/visits_controller.rb

	def create
		if Visit.exists?(params[:user])
			@visits = Visit.find(params[:user])
			@visits.increment
		else
			@visits = Visit.new
			@visits.id = params[:user]
			@visits.set_counter
		end
		@visits.save
---
SELECT  "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "visits" SET "visit_counter" = $1, "updated_at" = $2 WHERE "visits"."id" = $3  [["visit_counter", 2], ["updated_at", 2017-01-29 08:01:15 UTC], ["id", 1]]
INSERT INTO "visits" ("id", "visit_counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 1], ["visit_counter", 1], ["created_at", 2017-01-29 08:01:05 UTC], ["updated_at", 2017-01-29 08:01:05 UTC]]

	def show
		@visits = Visit.find(params[:user])
---
SELECT  "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]