hm_term2_rest_api_projects/11a_02_24/rails_project/app/controllers/cars_controller.rb

INSERT INTO "cars" ("manufacturer", "carmodel", "fueltype", "fuelconsumption", "cylinders", "capacity", "valves", "compression", "maximumspeed", "horsepower", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
	def create
		j = JSON.parse(request.raw_post)
		@car = Car.new
		@car[:manufacturer] = j['Manufacturer']
		@car[:carmodel] = j['Model']
		@car[:fueltype] = j['Fuel_type']
		@car[:fuelconsumption] = j['Fuel_consumption']
		@car[:cylinders] = j['Number_of_cylinders']
		@car[:capacity] = j['Engine_capacity']
		@car[:valves] = j['Number_of_valves']
		@car[:compression] = j['Compression Ratio']
		@car[:maximumspeed] = j['Maximum_speed']
		@car[:horsepower] = j['Horse_power']
		@car.save

SELECT  "cars".* FROM "cars" LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 4]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "cars" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 5], ["OFFSET", 15]]
SELECT  "cars".* FROM "cars" WHERE "cars"."manufacturer" = $1 LIMIT $2 OFFSET $3  [["manufacturer", "BMW"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT  "cars".* FROM "cars" WHERE "cars"."manufacturer" = $1 AND "cars"."fueltype" = $2 LIMIT $3 OFFSET $4  [["manufacturer", "Fiat"], ["fueltype", "diesel"], ["LIMIT", 5], ["OFFSET", 5]]
SELECT  "cars".* FROM "cars" WHERE "cars"."manufacturer" = $1 AND "cars"."carmodel" = $2 LIMIT $3 OFFSET $4  [["manufacturer", "BMW"], ["carmodel", "X3"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "cars" WHERE "cars"."manufacturer" = $1 AND "cars"."carmodel" = $2 LIMIT $3 OFFSET $4) subquery_for_count  [["manufacturer", "BMW"], ["carmodel", "X3"], ["LIMIT", 5], ["OFFSET", 0]]
---
	def index
			#arr = Car.all.page(params[:page])
			@cars = Car.all.page(params[:page])
			#@cars = Car.where(nil)
			 @cars = @cars.manufacturer(params[:manufacturer]) if params[:manufacturer].present?
			 @cars = @cars.fueltype(params[:fueltype]) if params[:fueltype].present?
			 @cars = @cars.carmodel(params[:carmodel]) if params[:carmodel].present?
			 @cars = @cars.fuelconsumption(params[:fuelconsumption]) if params[:fuelconsumption].present?
			 @cars = @cars.cylinders(params[:cylinders]) if params[:cylinders].present?
			 @cars = @cars.capacity(params[:capacity]) if params[:capacity].present?
			 @cars = @cars.valves(params[:valves]) if params[:valves].present?
			 @cars = @cars.compression(params[:compression]) if params[:compression].present?
			 @cars = @cars.maximumspeed(params[:maximumspeed]) if params[:maximumspeed].present?
			 @cars = @cars.horsepower(params[:horsepower]) if params[:horsepower].present?



			 if @cars.any?

SELECT "cars".* FROM "cars" WHERE (manufacturer = 'Lada')
---
	def get_by_manufacturer
			arr = Car.all

SELECT "cars".* FROM "cars"
---
	def get_manufacturers
		arr = Car.all

UPDATE "cars" SET "cylinders" = $1, "capacity" = $2, "maximumspeed" = $3, "horsepower" = $4, "updated_at" = $5 WHERE "cars"."id" = $6  [["cylinders", 0], ["capacity", 3000], ["maximumspeed", 210.0], ["horsepower", 117.0], ["updated_at", "2017-06-20 10:51:00.607968"], ["id", 13]]
---
	def update
		@car = Car.find_or_initialize_by(id: params[:id])

		if @car.persisted?
			j = JSON.parse(request.raw_post)
			@car[:manufacturer] = j['Manufacturer']
			@car[:carmodel] = j['Model']
			@car[:fueltype] = j['Fuel_type']
			@car[:fuelconsumption] = j['Fuel_consumption']
			@car[:cylinders] = j['Number_of_cylinders']
			@car[:capacity] = j['Engine_capacity']
			@car[:valves] = j['Number_of_valves']
			@car[:compression] = j['Compression Ratio']
			@car[:maximumspeed] = j['Maximum_speed']
			@car[:horsepower] = j['Horse_power']
			@car.save

DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 2]]
---
	def destroy
		@car = Car.find_or_initialize_by(id: params[:id])

		if @car.persisted?
		render :json =>
			{
				"id" => @car[:id],
				"manufacture" => @car[:manufacturer],
				"model" => @car[:carmodel],
				"fueltype" => @car[:fueltype],
				"fuelconsumption" => @car[:fuelconsumption],
				"cylinders" => @car[:cylinders],
				"capacity" => @car[:capacity],
				"valves" => @car[:valves],
				"compression" => @car[:compression],
				"maximumspeed" => @car[:maximumspeed],
				"horsepower" => @car[:horsepower]
			}, :status => 204

		else
			render :json => {}, :status => 404
		end
		@car.destroy