h27_rails_visits_homework/A_11_Ivan_Milev/app/controllers/visits_controller.rb

SELECT  "visits".* FROM "visits" WHERE "visits"."userid" = $1 LIMIT $2  [["userid", 3], ["LIMIT", 1]]
---
	def index
		id = -1
		params.each do |k, v|
			if k == 'user'
				id = v.to_i
			end
		end
		@visiter = Visit.find_by userid: id

SELECT  "visits".* FROM "visits" WHERE "visits"."userid" = $1 LIMIT $2  [["userid", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "visits" WHERE "visits"."userid" = $1 LIMIT $2  [["userid", 1], ["LIMIT", 1]]
INSERT INTO "visits" ("userid", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["userid", 1], ["created_at", 2017-01-28 11:14:13 UTC], ["updated_at", 2017-01-28 11:14:13 UTC]]
UPDATE "visits" SET "times" = $1, "updated_at" = $2 WHERE "visits"."id" = $3  [["times", 1], ["updated_at", 2017-01-28 11:20:43 UTC], ["id", 1]]
---
	def visit
		p "Post methos aquared"
		id = params['user'].to_i
		if Visit.exists?(userid: id )
			user = Visit.find_by userid: id
			user.times = user.times + 1
			user.save!