h27_rails_visits_homework/B_17_Lachezar_Mladenov/app/controllers/visits_controller.rb

	def index
		@data = Visit.all
---
SELECT "visits".* FROM "visits"

	def create
		@visits = construct
		@visits.update
---
UPDATE "visits" SET "visits" = $1 WHERE "visits"."id" = $2  [["visits", 1], ["id", 55]]