h27_rails_visits_homework/B_16_Ivan_Trifonov/app/controllers/viditors_controller.rb

SELECT  "viditors".* FROM "viditors" WHERE "viditors"."user" = $1 LIMIT 1  [["user", 1]]
SELECT  1 AS one FROM "viditors" WHERE "viditors"."user" = $1 LIMIT 1  [["user", 1]]
UPDATE "viditors" SET "count" = $1, "updated_at" = $2 WHERE "viditors"."id" = $3  [["count", 2], ["updated_at", "2017-01-28 19:09:34.434991"], ["id", 2]]
INSERT INTO "viditors" ("user", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user", 1], ["count", 1], ["created_at", "2017-01-28 19:02:58.028576"], ["updated_at", "2017-01-28 19:02:58.028576"]]
---
	def create

			if Viditor.exists?(user: params[:user])
				@goshos = Viditor.find_by(user: params[:user])
			  @goshos.count += 1
				@goshos.save
			else
				@goshos = Viditor.new
				@goshos.user = params[:user]
				@goshos.count += 1
				@goshos.save

SELECT  "viditors".* FROM "viditors" WHERE "viditors"."user" = $1 LIMIT 1  [["user", 5]]
---
	def show

		@goshos=Viditor.find_by(user: params[:user])