h27_rails_visits_homework/A_02_Blagovest_Mihailov/app/controllers/visits_controller.rb

	def index
		@visit = Visit.find_or_initialize_by(:user => params[:user])
---
SELECT  "visits".* FROM "visits" WHERE "visits"."user" = $1 LIMIT $2  [["user", 5], ["LIMIT", 1]]

	def create
		@visit = Visit.find_or_initialize_by(:user => params[:user])
		if !@visit.persisted?
			@add = Visit.new
      			@add[:user] = params[:user]
      			@add[:count] = 1
      			@add.save

		else
			@visit[:count] = @visit[:count] + 1
			@visit.save
---
SELECT  "visits".* FROM "visits" WHERE "visits"."user" = $1 LIMIT $2  [["user", 5], ["LIMIT", 1]]
INSERT INTO "visits" ("user", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user", 5], ["count", 1], ["created_at", 2017-01-28 15:33:31 UTC], ["updated_at", 2017-01-28 15:33:31 UTC]]
UPDATE "visits" SET "count" = $1, "updated_at" = $2 WHERE "visits"."id" = $3  [["count", 2], ["updated_at", 2017-01-28 15:33:33 UTC], ["id", 1]]